Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Kerala.c
// em_display.c
// Driver layer 
#include "r_cg_macrodriver.h"
#include "typedef.h"            /* GCSE Standard definitions */
#include "r_cg_wdt.h"
#include "r_cg_rtc.h"
#include "r_cg_sau.h"           /* CG Serial Driver */
#include "emeter3_structs.h"

// Application layer 
#include "platform.h"
#include "r_lcd_display.h"      /* LCD Display Application Layer */
#include "r_lcd_config.h"
#include "em_display.h"         /* EM Display Application Layer */
#include "event.h"
#include "powermgmt.h"
#include "pravakComm.h"
#include "emeter3_app.h"
#include "memoryOps.h"
#include "e2rom.h"
#include "tampers.h"
#include "utilities.h"
#include "em_display_Kerala_Helper.h"

// Display tamper condition
#include "format.h"
#include "eeprom.h"
#include "em_core.h"
#include "r_dlms_obis_ic.h"	// for date_time_t
#include "r_dlms_data.h"	// date_time_t to ext_rtc_t conversion functions

void display_autoScroll(void);
void display_onDemand(void);
void display_Third(void);

void EM_LCD_DisplayPOR(void);

void EM_DisplayDate(void);
void EM_DisplayInstantTime(void);

void EM_LCD_DisplayStatus(void);

uint8_t BCD2DEC(uint8_t BCD_number);

// utility icon functions
void LCD_DisplaykWSign(void);
void LCD_DisplaykVASign(void);
void LCD_DisplaykVArSign(void);
void LCD_DisplaykWhSign(void);
void LCD_DisplaykVAhSign(void);
void LCD_DisplaykVArhSign(void);
void lcd_display_date(uint8_t dat, uint8_t mth, uint8_t yr);
void lcd_display_time(uint8_t hr, uint8_t min, uint8_t sec);
//void displayTamperName(uint8_t eventCode);	// this function is superseded in Kerala
void d_Tampers(void);

#define RETURN_TO_AUTOSCROLL_COUNT	7500	// corresponds to 300 seconds or 5 minutes

#ifdef BIDIR_METER
	#define NO_OF_SUB_DISPLAY_STATES 4	// BIDIR_METER has 4
#else
	#define NO_OF_SUB_DISPLAY_STATES 3	// Regular Gujarat Meter has 3
#endif


const uint8_t msg_nil_tamper[8] = {LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CHAR_N, LCD_CHAR_I, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t msg_yes_tamper[8] = {LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CHAR_Y, LCD_CHAR_E, 5, LCD_CLEAR_DIGIT};
/*
const uint8_t msg_miss_R[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t msg_miss_Y[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t msg_miss_B[8]     = {LCD_CHAR_M, 1, 5, 5, LCD_CHAR_P, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t msg_over_V[8]     = {LCD_CHAR_O, LCD_CHAR_V, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_V, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_under_V[8]    = {LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_D, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_V, LCD_CLEAR_DIGIT};
const uint8_t msg_unbal_V[8]    = {LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_R[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_Y[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t curr_rev_B[8]    = {LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CHAR_R, LCD_CHAR_E, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_R[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_R, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_Y[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CLEAR_DIGIT};
const uint8_t curr_fail_B[8]    = {LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_A, 1, LCD_CHAR_L, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CLEAR_DIGIT};
const uint8_t msg_unbal_C[8]    = {LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_U, LCD_CHAR_N, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t msg_bypass_C[8]    = {LCD_CHAR_C, LCD_CHAR_B, LCD_CHAR_Y, LCD_CHAR_P, LCD_CHAR_A, 5, 5, LCD_CLEAR_DIGIT};
const uint8_t msg_over_C[8]     = {LCD_CHAR_O, LCD_CHAR_V, LCD_CHAR_E, LCD_CHAR_R, LCD_MINUS_SIGN, LCD_CHAR_C, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_C_Open[8]     = {LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_O, LCD_CHAR_P, LCD_CHAR_E, LCD_CHAR_N, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_Magnet[8]     = {LCD_CHAR_M, LCD_CHAR_A, LCD_CHAR_G, LCD_CHAR_N, LCD_CHAR_E, LCD_CHAR_T, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t msg_ND[8]     = {LCD_CHAR_N, LCD_MINUS_SIGN, LCD_CHAR_D, 1, 5, LCD_CHAR_T, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
*/
const uint8_t Bat_OK[8]     = {LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_G, LCD_CHAR_D, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t Bat_LO[8]     = {LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_D, LCD_CLEAR_DIGIT};

const uint8_t NVM_OK[8]     = {LCD_CHAR_N, LCD_CHAR_V, LCD_CHAR_M, LCD_MINUS_SIGN, LCD_CHAR_G, LCD_CHAR_D, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t NVM_BAD[8]    = {LCD_CHAR_N, LCD_CHAR_V, LCD_CHAR_M, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_D, LCD_CLEAR_DIGIT};

const uint8_t RTC_OK[8]     = {LCD_CHAR_R, LCD_CHAR_T, LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_G, LCD_CHAR_D, LCD_CLEAR_DIGIT, LCD_CLEAR_DIGIT};
const uint8_t RTC_BAD[8]    = {LCD_CHAR_R, LCD_CHAR_T, LCD_CHAR_C, LCD_MINUS_SIGN, LCD_CHAR_B, LCD_CHAR_A, LCD_CHAR_D, LCD_CLEAR_DIGIT};


uint8_t disp_state;
uint8_t disp_timer;
uint8_t disp_autoscroll_interval=6;
uint8_t holdState;
uint8_t g_tamper_display_state;

uint8_t			g_display_mode = 0;	// 0 - Autoscroll, 1- OnDemand, 2-ThirdDisplay, 3-Special Autoscroll
//uint8_t			g_display_update_type =0;	// 0 - Autoincrement, 1- OnKeyPressOnly, 2-AutoIncrementEverysecond, 3-KeyPressIncrementEverySecond
uint8_t     g_is_por = 0;

uint8_t splTimer;
uint8_t gentimer;
uint8_t tamperTimer;

uint8_t comm_mode;
uint8_t commModeTimer;
uint8_t gLcdCheck;

uint8_t kbscanflag;
uint8_t keyPressedCtr;
uint16_t keyNotPressedCtr;

//uint8_t keyNotPressedCtr;
uint8_t keyPressedCtr1;
uint8_t keyNotPressedCtr1;

uint8_t keyPressedCtr2;
uint8_t keyNotPressedCtr2;

