Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Kerala.c
}


//avoidShowingRepeatParameters
void handleDisplay_Gujarat(uint8_t t)
{// disp_timer is incremented in the interrupt callback function
	uint8_t previous_disp_state;
  powermgmt_mode_t power_mode;

//	disp_autoscroll_interval=5;
	
	if((g_display_mode==255)||(seconds_flag==0))	// things are not ready yet
		return;

	if(mode_has_been_changed==1)
	{
		if(disp_timer<3)
			return;
		else
		{
			mode_has_been_changed=0;
			fwdKeyPressed=0;	// this is to ensure that after mode display is cleared user must press either key to proceed
			revKeyPressed=0;
			someKeyPressed=0;
			bothKeysPressedCtr=0;
			disp_timer=0;
			mode_timeout_ctr=0;
			fast_display_flag=0;
			holdState=0;
			disp_state=0;
			disp_timer=disp_autoscroll_interval;	// this is to ensure entry below
		}
	}
		
	power_mode = POWERMGMT_GetMode();	// actual function to be used

	if((power_mode == POWERMGMT_MODE1)&&(gLcdCheck==0))
			EM_LCD_DisplayStatus();

#ifdef MAGTEST	
	return;
#endif	


	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)
	{
		if(g_display_mode==0)
			fast_display_flag=1;
	}

  if((disp_timer >= disp_autoscroll_interval)||(someKeyPressed==1)||(fast_display_flag==1))
	{
		seconds_flag=0;
		if(someKeyPressed==0)
		{
			if(g_display_mode==0)
			{
				if(autoscrollInButtonMode==0)
				{
					if(fast_display_flag==0)
					{
						if(holdState==0)
							disp_state++;
						else
							g_tamper_display_state++;
					}
					else
					{// here fast_display_flag = 1 - wait for autoscroll interval before incrementing state
						fast_display_counter++;
						if(fast_display_counter>disp_autoscroll_interval)
						{
							fast_display_flag=0;
							fast_display_counter=0;
							disp_state++;
						}
					}
				}
			}
			disp_timer=0;
		}
		else
		{// here some key has been pressed
			disp_timer=0;
			someKeyPressed=0;
			mode_timeout_ctr=0;
			fast_display_flag=0;
			
			if(fwdKeyPressed==1)
			{
				fwdKeyPressed=0;
				fwdKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(holdState==0)
					disp_state++;
				else
					g_tamper_display_state++;
			}
			
			if(revKeyPressed==1)
			{
				revKeyPressed=0;
				revKeyPressedCtr=0;
				
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(disp_state==0)
				{// we need to go to the last state
					switch(g_display_mode)
					{
						case 0:
							disp_state=25;	// last autoscroll state
							break;
							
						case 1:
							disp_state=68;	// last pushbutton state
							break;
							
						case 2:
							disp_state=3;	// last highres state
							break;
							
						default:
							break;
							
					}
				}
				else
				{
					disp_state--;
					holdState=0;
				}
			}
		}
		
		if(disp_autoscroll_interval==20)
			disp_autoscroll_interval=6;	// restore it 
			
		gLcdCheck=0;
		
		switch(g_display_mode)
		{
			case 0:	// autoscroll
				display_autoScroll();
				break;
				
			case 1:	// pushbutton
				display_onDemand();
				break;
				
			case 2:	// third display mode
				display_Third();
				break;
				
			default:
				makeDisplayReadyForAutoScroll();
				break;
		}
	}
}


//----------------------------------------------------------------------------------------------------------------------------------------
// this is for UNIDIR meter
uint32_t gTamperEvent;
uint8_t g_tamper_display_state;
uint8_t g_cover_display_state;
uint8_t cover_disp_timer;

void display_autoScroll(void)
{
	date_time_t DateTime;
	float32_t tempFloat;
	int32_t tempTodKwh;
	int32_t tempLong;
	int32_t tempLong1;
	uint16_t tempTodMD;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;
	uint8_t zone;
	powermgmt_mode_t power_mode;

  R_WDT_Restart();
  LCD_ClearAll();	
	
	if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
	{
		if((splTimer%2)==0)
		{
			LCD_DisplayDigit(2, LCD_CHAR_C);
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, 0);
			LCD_DisplayDigit(5, LCD_CHAR_P);
			LCD_DisplayDigit(6, LCD_CHAR_E);
			LCD_DisplayDigit(7, LCD_CHAR_N);
			return;
		}
	}


	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}

	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if((power_mode == POWERMGMT_MODE1)&&(gLcdCheck==0))
			EM_LCD_DisplayStatus();

	if(disp_state>25)
		disp_state=0;

	switch(disp_state)
	{
    case 0:			// all on
      LCD_DisplayAll();
			fast_display_flag=0;
			gLcdCheck=1;
      break;			

    case 1:			// battery check
			if(Common_Data.rtc_failed==0)
	    {// Battery is good
				lcd_msg((const uint8_t*)&Bat_OK);
	    }
			else
	    {// Battery is Bad
				lcd_msg((const uint8_t*)&Bat_LO);
	    }
			break;
			
    case 2:		// date
			EM_DisplayDate();
			fast_display_flag=0;
      break;

    case 3:		// time
			EM_DisplayInstantTime();
			fast_display_flag=1;
      break;
			
    case 4:		// present status of occured tampers
			d_Tampers();
			fast_display_flag=0;
      break;

		case 5:		// Phase Sequence - Voltage
				if((g_TamperStatus&MISSPOT_MASK)==0)
				{// here no potential is missing
					if(gPhaseSequence==0)
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_Y);
						LCD_DisplayDigit(5, LCD_CHAR_B);
					}
					else
					{
						LCD_DisplayDigit(3, LCD_CHAR_R);
						LCD_DisplayDigit(4, LCD_CHAR_B);
						LCD_DisplayDigit(5, LCD_CHAR_Y);
					}
				}
				else
				{// here some potential is missing
					LCD_DisplayDigit(3, LCD_MINUS_SIGN);
					LCD_DisplayDigit(4, LCD_MINUS_SIGN);
					LCD_DisplayDigit(5, LCD_MINUS_SIGN);
				}

	    LCD_DisplayDigit(9, LCD_CHAR_P);
	    LCD_DisplayDigit(8, 5);
			disp_autoscroll_interval=6;
			fast_display_flag=1;
     	break;
			
    case 6:		// total kwh - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			disp_autoscroll_interval=20;
			fast_display_flag=0;
     	break;

		case 7:	// All zones (script_ids) TOD 1,2,3... kwh current
			display_TOD_KWH_CURRENT();
			break;

    case 8:		// L1 - Cum kwh
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+16,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplayDigit(9, 1);
			fast_display_flag=0;
     break;

// TOD wise Bill period kwh
		case 9:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_KWH_BILL(1);	// 1-L1
			break;
		 
    case 10:		// Voltage - R
			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_R)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

    case 11:		// Voltage - Y
			tempLong = getInstantaneousParams(IVOLTS,LINE_PHASE_Y)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
      break;

