Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Kerala.c
    case 12:		// Voltage - B
			tempLong =getInstantaneousParams(IVOLTS,LINE_PHASE_B)*100;
			display_long_two_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
	    LCD_DisplaySpSign(S_T2);	// V
			fast_display_flag=1;
	    break;

    case 13:		// Current - R with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_R)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			lcd_display_A();
			fast_display_flag=1;
      break;

    case 14:		// Current - Y with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_Y)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_Y);
			lcd_display_A();
			fast_display_flag=1;
      break;

   	case 15:		// Current - B with direction
			tempLong = getInstantaneousParams(ICURRENTS,LINE_PHASE_B)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_B);
			lcd_display_A();
			fast_display_flag=1;
      break;

    case 16:		// Average PF for last billing period
			tmonth = decrementMonth(1);
			if(Common_Data.bpcount==0)
				tempLong=0;
			else
      	EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+12,(uint8_t*)&tempLong,sizeof(tempLong));
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_BILL);
			lcd_display_A();
			LCD_DisplayDigit(1, LCD_CHAR_P);
			LCD_DisplayDigit(2, LCD_CHAR_F);
			LCD_DisplayDigit(9, 1);
  		LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
	    break;

    case 17:		// pf total with sign
    	pf_sign = (EM_PF_SIGN)getInstantaneousParams(PFSIGNVAL,LINE_TOTAL);
			tempLong = getInstantaneousParams(IPFS,LINE_TOTAL)*1000;
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(1, LCD_CHAR_P);	
			LCD_DisplayDigit(2, LCD_CHAR_F);	

			LCD_DisplayDigit(9, LCD_CHAR_T);
			if(ABS(tempLong)>10)
			{
				if (pf_sign == PF_SIGN_LEAD_C)
				{
		    	LCD_DisplaySpSign(S_LEAD);
				}
				else if (pf_sign == PF_SIGN_LAG_L)
				{
		    	LCD_DisplaySpSign(S_LAG);
				}
				else if (pf_sign == PF_SIGN_UNITY)
				{
		    	LCD_ClearSpSign(S_LEAD);
		    	LCD_ClearSpSign(S_LAG);
				}
			}
			fast_display_flag=0;
		 break;

    case 18:		// Instant Load in kW
			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
			fast_display_flag=1;
	    break;

// Bill TOD MD in kva with date and time			
		case 19:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_MDKVA_DTTM_BILL(1);	// 1-L1
			break;
			
    case 20:		// L1 - Cum kVAh
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+52,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVAhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplayDigit(9, 1);
			fast_display_flag=0;
     	break;

// Bill TOD kvah			
// TOD wise Bill period kvah
		case 21:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_KVAH_BILL(1);	// 1-L1
			break;
		 
    case 22:		// total kvarh_lag - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvarh_lag/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
    	LCD_DisplaySpSign(S_LAG);
			fast_display_flag=0;
     	break;

    case 23:		// total kvarh_lead - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvarh_lead/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
    	LCD_DisplaySpSign(S_LEAD);
			fast_display_flag=0;
     	break;
			
    case 24:		// now for E2rom check
			tempchar=perform_E2ROM_Test(0);
			if(tempchar==0)
			{// e2rom is good
				lcd_msg((const uint8_t*)&NVM_OK);
			}
			else
			{// E2ROM is failed
				lcd_msg((const uint8_t*)&NVM_BAD);
			}
      break;
			
    case 25:		// now for RTC check - always good
			lcd_msg((const uint8_t*)&RTC_OK);
			break;
	}
}

void display_onDemand(void)
{
//	toddata_t temptoddata;
	int32_t tempTodKwh;
  powermgmt_mode_t power_mode;
	int32_t tempLong;
	uint16_t tempint;
	date_time_t DateTime;
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;
	uint8_t zone;

  R_WDT_Restart();
  LCD_ClearAll();

	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if((power_mode == POWERMGMT_MODE1)&&(gLcdCheck==0))
			EM_LCD_DisplayStatus();

	if(disp_state==255)
		disp_state=0;
		
	if(disp_state>68)
		disp_state=0;	// go back to the beginning
	
	switch(disp_state)
	{
		
    case 0:			// all on
      LCD_DisplayAll();
			fast_display_flag=0;
			gLcdCheck=1;
      break;			
		
    case 1:			// battery check
			if(Common_Data.rtc_failed==0)
	    {// Battery is good
				lcd_msg((const uint8_t*)&Bat_OK);
	    }
			else
	    {// Battery is Bad
				lcd_msg((const uint8_t*)&Bat_LO);
	    }
			fast_display_flag=0;
      break;
		
    case 2:			// meter no
			LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT,0);
			lcd_display_id();	
      break;
			
    case 3:			// frequency
			tempLong = getInstantaneousParams(IFREQS,LINE_TOTAL)*100;
			display_long_two_dp(tempLong);
		  LCD_DisplayDigit(1, LCD_CHAR_F);
		  LCD_DisplayDigit(9, LCD_CHAR_H);
		  LCD_DisplayDigit(8, 2);
      break;
			
    case 4:		// total kwh - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			disp_autoscroll_interval=20;
			fast_display_flag=0;
     	break;
			
    case 5:		// current month average pf
			tempLong = computeAveragePF(myenergydata.kwh, myenergydata.kvah, IMPORT);
      display_long_three_dp(tempLong);
			lcd_display_A();
			LCD_DisplayDigit(1, LCD_CHAR_P);
			LCD_DisplayDigit(2, LCD_CHAR_F);
			fast_display_flag=0;
     	break;
			
    case 6:		// current month average pf - lag
			tempLong = computeAveragePF_Lag_Lead(myenergydata.kwh_lag, myenergydata.kvah_lag, 0);
      display_long_three_dp(tempLong);
			lcd_display_A();
			LCD_DisplayDigit(1, LCD_CHAR_P);
			LCD_DisplayDigit(2, LCD_CHAR_F);
    	LCD_DisplaySpSign(S_LAG);
			fast_display_flag=0;
     	break;
			
    case 7:		// current month average pf - lead
			tempLong = computeAveragePF_Lag_Lead(myenergydata.kwh_lead, myenergydata.kvah_lead, 1);
      display_long_three_dp(tempLong);
			lcd_display_A();
			LCD_DisplayDigit(1, LCD_CHAR_P);
			LCD_DisplayDigit(2, LCD_CHAR_F);
    	LCD_DisplaySpSign(S_LEAD);
			fast_display_flag=0;
     	break;
			
    case 8:		// Instant Load in kW
			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
			fast_display_flag=1;
	    break;

    case 9:		// Instant Load in kVA
			tempLong = getInstantaneousParams(APP_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykVASign();
			fast_display_flag=1;
	    break;

    case 10:		// Rising MD in kVA
	    tempchar=60/(int32_t)Common_Data.mdinterval;
			tempLong = ((myenergydata.kvah-ctldata.kvah_last_saved)*(int32_t)tempchar);
			
			if(tempLong<0)
				tempLong=0;
			display_long_three_dp(tempLong);	// rising MD
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
	    LCD_DisplaySpSign(S_TIME);	// show the time icon also

// we can also display the minutes elapsed
			tempchar = rtc.minute - ((rtc.minute/Common_Data.mdinterval)*Common_Data.mdinterval); 
  		LCD_DisplayDigit(1, LCD_CHAR_R);
  		LCD_DisplayDigit(2, LCD_CHAR_D);
  		LCD_DisplayDigit(9, tempchar/10);
  		LCD_DisplayDigit(8, tempchar%10);
			fast_display_flag=1;
      break;

    case 11:		// total kvah - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvah/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVAhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     	break;

		case 12:	// All zones (script_ids) TOD 1,2,3... kvah current
			display_TOD_KVAH_CURRENT();
			break;
			
    case 13:		// Current MD in kw
			display_long_three_dp(mymddata.mdkw);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
			
    case 14:		// Cumulative MD in kw
			display_long_three_dp(ctldata.cumulative_md);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// TOD wise current MD kw with date and time 			
// Current TOD MDkw with date and time			
		case 15:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_MDKW_DTTM_CURRENT();	// Current
			break;

