Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Kerala.c
    case 16:		// Resultant MD in kVA
			display_long_three_dp(mymddata.mdkva);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
						
    case 17:		// Cumulative MD in kVA
			display_long_three_dp(ctldata.cumulative_md_kva);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

			
// TOD wise current MD kva with date and time 			
// Current TOD MDkva with date and time			
		case 18:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_MDKVA_DTTM_CURRENT();	// Current
			break;

// L1 - KWH TOD 1,2,3
		case 19:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_KWH_BILL(1);
			break;

// L2 to L6 - Cumulative kwh
    case 20:		// L2 kwh
    case 21:		// L3 kwh
    case 22:		// L4 kwh
    case 23:		// L5 kwh
    case 24:		// L6 kwh
			tempchar=disp_state - (20-2);	// start from 2 onwards
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+16,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_BILL);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplayDigit(9, tempchar);
			fast_display_flag=0;
      break;
			
// L1 - KVAH TOD 1,2,3
		case 25:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_KVAH_BILL(1);
			break;

// L2 to L6 - Cumulative kVAh
    case 26:		// L2 kvah
    case 27:		// L3 kvah
    case 28:		// L4 kvah
    case 29:		// L5 kvah
    case 30:		// L6 kvah
			tempchar=disp_state - (26-2);	// start from 2 onwards
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+52,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVAhSign();
		  LCD_DisplaySpSign(S_BILL);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplayDigit(9, tempchar);
			fast_display_flag=0;
      break;
			
// Bill TOD MD in kva WITHOUT date and time			
		case 31:	// All zones (script_ids) TOD 1,2,3... L1 Bill
			display_TOD_MDKVA_BILL(1);	// 1-L1
			break;

// L2 to L6 - MD KVA
    case 32:		// L2 MD KVA
    case 33:		// L3 MD KVA
    case 34:		// L4 MD KVA
    case 35:		// L5 MD KVA
    case 36:		// L6 MD KVA
			tempchar=disp_state - (32-2);	// start from 2 onwards
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+192,(uint8_t*)&tempLong,4);
			display_long_three_dp(tempLong);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_BILL);
		  LCD_DisplaySpSign(S_MD);			
			LCD_DisplayDigit(9, tempchar);
			fast_display_flag=0;
      break;

// L1 - L6 KVARH Lag
    case 37:		// L1 kvarh_lag
    case 38:		// L2 kvarh_lag
    case 39:		// L3 kvarh_lag
    case 40:		// L4 kvarh_lag
    case 41:		// L5 kvarh_lag
    case 42:		// L6 kvarh_lag
			tempchar=disp_state - (37-1);	// start from 1 onwards
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+44,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_BILL);
  		LCD_DisplaySpSign(S_LAG);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplayDigit(9, tempchar);
			fast_display_flag=0;
      break;

// L1 - L6 KVARH Lead
    case 43:		// L1 kvarh_lead
    case 44:		// L2 kvarh_lead
    case 45:		// L3 kvarh_lead
    case 46:		// L4 kvarh_lead
    case 47:		// L5 kvarh_lead
    case 48:		// L6 kvarh_lead
			tempchar=disp_state - (43-1);	// start from 1 onwards
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+48,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
		  LCD_DisplaySpSign(S_BILL);
  		LCD_DisplaySpSign(S_LEAD);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			LCD_DisplayDigit(9, tempchar);
			fast_display_flag=0;
      break;

// No of tamper events - total tamper count
    case 49:		// Total Tamper count
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// Latest occured tamper details with date and time - 78,79,80
    case 50:		// latest occured tamper
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			tempint=findEventCode(tempchar,1);	// 1 stands for occurence
			LCD_DisplayIntWithPos(tempint, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 1);
			LCD_DisplayDigit(2, LCD_CHAR_D);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;

    case 51:		// latest occured tamper date
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;

    case 52:		// latest occured tamper time
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
			
// Second Latest occured tamper details with date and time - 81,82,83
    case 53:		// second latest occured tamper
			EPR_Read(SECOND_LAST_OCCURED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			tempint=findEventCode(tempchar,1);	// 1 stands for occurence
			LCD_DisplayIntWithPos(tempint, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 1);
			LCD_DisplayDigit(2, LCD_CHAR_D);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

    case 54:		// second latest occured tamper date
			EPR_Read(SECOND_LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

    case 55:		// second latest occured tamper time
			EPR_Read(SECOND_LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

// Latest restored tamper details with date and time - 84,85,86
    case 56:		// latest restored tamper
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			tempint=findEventCode(tempchar,0);	// 0 stands for restoration
			LCD_DisplayIntWithPos(tempint, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 1);
			LCD_DisplayDigit(2, LCD_CHAR_D);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;

    case 57:		// latest restored tamper date
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;

    case 58:		// latest restored tamper time
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;

