Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_Kerala.c
// Second Latest restored tamper details with date and time - 87,88,89
    case 59:		// second latest restored tamper
			EPR_Read(SECOND_LAST_RESTORED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			tempint=findEventCode(tempchar,0);	// 0 stands for restoration
			LCD_DisplayIntWithPos(tempint, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 1);
			LCD_DisplayDigit(2, LCD_CHAR_D);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

    case 60:		// second latest restored tamper date
			EPR_Read(SECOND_LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

    case 61:		// second latest restored tamper time
			EPR_Read(SECOND_LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 2);
			fast_display_flag=0;
      break;

// Power Off duration
    case 62:		// Total power oFF time in hours - minutes earlier
			tempLong = computePowerOffDurn(rtc);	// use the rtc for current value and returns power fail duration for the month
			tempLong += Common_Data.cumPowerFailDuration;	// now it is cumulative
			
			tempLong = tempLong/60;	// now hours
		
			LCD_DisplayIntWithPos(tempLong, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 0);
			LCD_DisplayDigit(2, LCD_CHAR_F);
			
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_M);
			fast_display_flag=0;
      break;

// Reset Count - billing count
    case 63:		// billing count
			LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
		  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

// Program count
    case 64:		// programming count
			LCD_DisplayIntWithPos(Common_Data.pgm_count, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
			
// Bill kwh lag
    case 65:		// L1 - Cum kwh lag
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+308,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_BILL);
	    LCD_DisplaySpSign(S_LAG);
			LCD_DisplayDigit(9, 1);
			fast_display_flag=0;
     	break;
			
// Bill kwh lead
    case 66:		// L1 - Cum kwh lead
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+312,(uint8_t*)&tempLong,4);
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(tempLong/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
		  LCD_DisplaySpSign(S_BILL);
	    LCD_DisplaySpSign(S_LEAD);
			LCD_DisplayDigit(9, 1);
			fast_display_flag=0;
     	break;

// Cumulative kwh lead
    case 67:		// total kwh lead - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh_lead/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
	    LCD_DisplaySpSign(S_LEAD);
			fast_display_flag=0;
     	break;

// Cumulative kwh lag
    case 68:		// total kwh lag - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh_lag/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
	    LCD_DisplaySpSign(S_LAG);
			fast_display_flag=0;
     	break;

	}
}

void display_Third(void)
{
	int32_t temp_high_res_energy;
	
  R_WDT_Restart();
  LCD_ClearAll();

	EM_LCD_DisplayStatus();

	if(disp_state==255)
		disp_state=0;
		
	if(disp_state>3)
		disp_state=0;
	
	switch(disp_state)
	{
    case 0:			// high resolution kwh
			temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykWhSign();
			fast_display_flag=1;
      break;
			
    case 1:			// high resolution kvarh lag
			temp_high_res_energy = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_LAG);
			fast_display_flag=1;
      break;
			
    case 2:			// high resolution kvarh lead
			temp_high_res_energy = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)high_resolution_kvarh_lead_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_LEAD);
			fast_display_flag=1;
      break;
			
    case 3:			// high resolution kvah
			temp_high_res_energy = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVAhSign();
			fast_display_flag=1;
      break;
	}
}



//This function is being rewritten

void d_Tampers(void)
{
	uint32_t gEvent;

	gEvent = mytmprdata.tamperEvent_image&TAMPER_DISPLAY_MASK; // make all those bits not to be displayed as 0
	
	if(gEvent==0)
	{// hereg_display_flag there are no tampers
		lcd_msg((const uint8_t*)&msg_nil_tamper);	// simbly display tamper nil
//		displayTamperName(0);	// 0 is to display the no tamper message
	}
	else
	{// here there is some tamper present i.e. some bits are 1
		lcd_msg((const uint8_t*)&msg_yes_tamper);	// simbly display tamper yes
	}
}


// Earlier function - prior to 08/Apr/2022
/*
// the function d_Tampers only displays unrestored tampers
void d_Tampers(void)
{
	uint32_t whichevent;
	uint8_t event_code_bit;
	uint8_t whichGroup;

	if(holdState==0)
	{
		gTamperEvent = mytmprdata.tamperEvent_image&TAMPER_DISPLAY_MASK; // make all those bits not to be displayed as 0
		holdState = 1;
		g_tamper_display_state = 0;	// safety
	}
	
//	switch(g_tamper_display_state)
//	{
//		case 0:
			if(gTamperEvent==0)
			{// hereg_display_flag there are no tampers
				displayTamperName(0);	// 0 is to display the no tamper message
			}
			else
			{// here there is some tamper present i.e. some bits are 1
			// only those bits which are to be displayed have not been masked, transaction events and cover open etc have been masked out
		    whichevent = gTamperEvent & ~(gTamperEvent-1);
				event_code_bit=findWhichBitIsOne(whichevent);	// bit numbers 1 to 15, 22, 23, 24, 29 and 30  - bit 0 is not used, others masked out
				displayTamperName(event_code_bit);
				gTamperEvent&=~whichevent;	// job complete for this fellow
			}
			
